#激活函数 Activation Function
  目前学习了四种激活函数
  sigmoid、tanh、relu、softmax
  第一个sigmoid函数可以将任意的输入映射到 (0, 1) 之间，当输入的值大致在 <-6 或者 >6 时，意味着输入任何值得到的激活值都是差不多的，这样会丢失部分的信息。sigmoid在网络5层之内会出现梯度消失的现象。一般二分类的输出层
  第二个tanh函数将输入映射到 (-1, 1) 之间，图像以 0 为中心，在 0 点对称，当输入 大概<-3 或者 >3 时将被映射为 -1 或者 1。其导数值范围 (0, 1)，当输入的值大概 <-3 或者 > 3 时，其导数近似 0。
      与 Sigmoid 相比，它是以 0 为中心的，且梯度相对于sigmoid大，使得其收敛速度要比 Sigmoid 快，减少迭代次数。然而，从图中可以看出，Tanh 两侧的导数也为 0，同样会造成梯度消失。  
  第三个relu函数relu激活函数将小于 0 的值映射为 0，而大于 0 的值则保持不变，它更加重视正信号，而忽略负信号，这种激活函数运算更为简单，能够提高模型的训练效率。当x<0时 relu的导数=0 此时随着训练推进，部分输入会落入小于0的区域
      对于的权重无法更新，导致出现“神经元死亡” 。ReLu还有一个兄弟 PRelu 这个函数可以接受负的信号 可以用来解决神经元死亡
  
  第四个 softmax 用于多分类过程中，它是二分类函数sigmoid在多分类上的推广，目的是将多分类的结果以概率的形式展现出来。输出的结果选取多分类中概率最大的那个
  常见参数初始化方法7种方式
  全0初始化，全1初始化，随机均匀分布初始化，正态分布初始化，kaiming初始化，xavier初始化，固定值初始化
  初始化的目的：1,打破对称性 2，防止梯度消失或者梯度爆炸 3，提高收敛速度
  激活函数使用最多的是Relu kaiming初始化专门是对Relu函数做出的优化设计
#神经网络的搭建  
  神经网络的搭建分为3步
    1. 定义一个类, 继承: nn.Module
    2. 在__init__()方法中, 搭建神经网络.
    3. 在 forward()方法中,完成: 前向传播.
#损失函数 在深度学习中，损失函数是用来 == 衡量模型参数质量的函数 ==, 衡量的方式是比较网络输出（预测值）和真实输出（真实值）的差异。
  ##多分类任务损失函数:大白话就是最小化正确类别所对应的预测概率的对数负数
  公式为：L=-∑ylog（S(f(x)) 
   二分类任务损失函数：公式中不包含sigmoid函数，使用的时候需要手动调用sigmoid激活函数
  公式为：L=-ylog(x)-(1-y)log(x)     y为真实值，x为样本的预测概率 L用来衡量真实值y与预测值x之间的损失结果
  ##回归任务 
    MAE损失函数 也叫L1loss 
        公式：误差绝对值之和/样本总数     缺点：在0点不可导 数据容易变得稀疏
    MSE损失函数 
        公式 ：误差平方值和/样本总是      缺点: 如果差值过大 可能存在梯度爆炸的情况 W新=W旧-学习率*梯度
    Smooth L1:基于上面两种函数做的综合 在{-1.1}是MSE 其他分段是MAE
    这样即解决了L1的0点不可导，也解决了MSE的梯度爆炸情况  多情况下使用smoothL1
#模型训练的三个概念
 Epochs：使用全部数据对模型进行完整的训练次数
  Batch ：使用训练集中的小部分样本对模型权重进行反向传播的参数更新，每次训练每批次样本的数量
  batch的计算方式为 batch=epochs/batch size+1
  iteration：使用一个batch数据对模型进行一次参数更新的过程，每次训练批次数 
#反向传播更新梯度时遇到的问题
###
碰到平缓区域，梯度值较小，参数优化变慢
碰到 “鞍点” ，梯度为 0，参数无法优化
碰到局部最小值，参数不是最优
#梯度下降的优化方法
##指数加权移动平均求和
